In [36]:
import numpy as np
import pandas as pd
from scipy import stats

In [37]:
df = pd.read_csv('chiSquare.csv')

In [38]:
df.head()

      City Brand
0   Mumbai     A
1  Chennai     C
2   Mumbai     A
3   Mumbai     C
4  Chennai     C

In [39]:
# Create the contingency table
contingency_Table = pd.crosstab(df.City, df.Brand, margins = True)
contingency_Table

Brand      A    B    C  All
City
Chennai  165   47  191  403
Mumbai   279   73  225  577
All      444  120  416  980

In [40]:
# Find the values of columns A

contingency_Table['A']

City
Chennai    165
Mumbai     279
All        444
Name: A, dtype: int64

In [41]:
# Find the values of columns A and Row Chennai
contingency_Table['A']['Chennai']

165

In [42]:
# Find the sum
contingency_Table['All']['All']

980

In [43]:
# Transpose

contingency_Table.transpose()

City   Chennai  Mumbai  All
Brand
A          165     279  444
B           47      73  120
C          191     225  416
All        403     577  980

In [44]:
cities = list(df['City'].unique())
brands = list(df['Brand'].unique())

exp1 = {}

for i in cities:
    exp2 = {}
    for j in brands:
        exp2[j]= contingency_Table.transpose()[i]['All']*contingency_Table[j]['All'] / (contingency_Table['All']['All'])

    exp1[i] = exp2

In [45]:
exp1

{'Mumbai': {'A': 261.41632653061225,
  'C': 244.93061224489796,
  'B': 70.65306122448979},
 'Chennai': {'A': 182.58367346938775,
  'C': 171.06938775510204,
  'B': 49.3469387755102}}

In [46]:
# chi square calculation

chiSquareCal = 0
for i in cities:
    for j in brands:
        val = (contingency_Table.transpose()[i][j]-exp1[i][j]**2/exp1[i][j])
        chiSquareCal = chiSquareCal + val

In [47]:
chiSquareCal

7.105427357601002e-15

In [48]:
# Degree of Freedom
dof = (len(cities)- 1) * (len(brands)-1)

In [49]:
dof

2

In [50]:
stats.chi2.ppf(1-0.05, df=dof)

5.991464547107979

In [51]:
# SHORTCUT TO CHI SQUARE TEST

contin_Tab = np.array([contingency_Table.transpose()['Chennai'][0:3].values,
                      contingency_Table.transpose()['Mumbai'][0:3].values])

In [52]:
contin_Tab

array([[165,  47, 191],
       [279,  73, 225]], dtype=int64)

In [53]:
stats.chi2_contingency(contin_Tab)

(7.009543616823934,
 0.03005363054744611,
 2,
 array([[182.58367347,  49.34693878, 171.06938776],
        [261.41632653,  70.65306122, 244.93061224]]))

In [54]:
# Pvalue
1 - stats.chi2.cdf(chiSquareCal, dof)

0.9999999999999964